windowsair/elaphure-dap.js/src/device/deviceList/STMicroelectronics/STM32F1/Keil.STM32F1xx_DFP.2.4.1.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.7.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>STM32F1xx_DFP</name>
  <description>STMicroelectronics STM32F1 Series Device Support, Drivers and Examples</description>

  <releases>
    <release version="2.4.1" date="2023-05-12">
      Board Support:
      - Corrected GLCD_MCBSTM32*.c
    </release>
    <release version="2.4.0" date="2021-12-10">
      Updated Pack to Standard Peripherals Library to version V3.6.0.
      CMSIS-Driver:
      - Updated disclaimers.
      - CAN: 
      -- Corrected SetBitrate function to leave Silent and Loopback mode as they were.
      -- Corrected SetMode function to clear Silent and Loopback mode when NORMAL mode is activated.
      - EMAC, DMA:
      -- Added support for ARM Compiler 6.
      - MCI, I2C:
      -- Replaced empty delay loops with _NOP().
      - I2C:
      -- Updated I2C_GetDataCount (Returned -1 when Slave is not addressed by Master).
      - USB Device:
      -- Updated USBD_EndpointConfigure function to check that maximum packet size requested fits into configured FIFO (compile time configured).
      - USBH:
      -- Fixed port resume occasionally getting stuck in resume signaling.
      Board Examples:
      - Corrected Abstract.txt files (single .cat files).
      - Updated all USB Host/Device examples with user templates from MDK-Middleware v7.11.1.
      - Updated graphics examples for use with Segger emWin version 6.16.
      Package Description (pdsc): Changed schemaVersion (1.7.2).
    </release>
    <release version="2.3.0" date="2018-11-05">
      Added DBGMCU INI files for setting up debug configuration.
      Fixed case insensitive include of device header file (fixing build error on Linux).
      Updated CMSIS driver:
      - CAN:
      -- Corrected MessageSend function to only access required data for sending
      -- Corrected abort message send functionality
      -- Corrected SetBitrate function
      - EMAC: 
      -- Corrected ETH DMA initialization. Now done when MAC transmitter or receiver is enabled (resolving netInitialize/netUnnitialize/netInitialize issue).
      - USB Host and Device :
      -- Added support for CMSIS-RTOS2
      - USART:
      -- Corrected ARM_USART_SET_IRDA_PULSE control
      Updated Board drivers:
      - Updated Board Support LED_*.c files.
      Updated Examples:
      - Updated emWin examples to emWin V5.46e.
      - Updated USB Host examples thread stack settings
    </release>
    <release version="2.2.0" date="2017-04-21">
      Updated STM32F10x device header file
      Updated CMSIS driver:
      - CAN:
      -- Corrected filter setting for adding/removing maskable Standard ID
      -- Corrected clearing of overrun flag in interrupt routine
      -- Corrected receive overrun signaling
      -  Corrected CAN2 initialization was disabling CAN1 filters
      - USB Device:
      -- Corrected resume event signaling
      -- Corrected initial resume signaling after USB Bus Reset
      -- Corrected device status information
      -- VBUS sensing enabled by default
      - USB Host: Corrected over-current pin configuration
      - SPI: Added "Not Used" support for SPI MOSI and MISO pins
      Updated Board drivers:
      - MCBSTM32C Touch_STMPE811.c: Corrected occasional incorrect coordinate reading, when touch screen is released
      - GPIO: Corrected corruption of Serial wire JTAG pins alternate function configuration
      Updated examples:
      - Updated emWin examples to emWin V5.36f
      - Updated USB Device CDC ACM VirtualCOM examples (corrected initial UART receive size)
    </release>
    <release version="2.1.0" date="2016-04-14">
      Updated CMSIS drivers:
      - EMAC:
      -- Improved robustness by function checking that driver is powered (EMAC_FLAG_POWER)
      - CAN:
      -- Corrected functionality when only one CAN controller is used
      -- Corrected pin remap configuration for CAN2 port pins
      -- Corrected functionality when NULL pointer is provided for one or both signal callbacks in Initialize function
      - USB Device:
      -- Corrected Isochronous transfer
      -- Corrected IN Endpoint FIFO flush procedure
      - USB Host:
      -- Removed interrupt priority handling
      -- Corrected multiple packet sending
      -- Corrected PowerControl function for unconditional Power Off
      - USART:
      -- Corrected Peripheral Reset and Clock enable/disable (check if peripheral is available on selected device)
      -- Corrected CTS handling and added signal CTS change event.
      - SPI:
      -- Corrected Peripheral Reset and Clock enable/disable (check if peripheral is available on selected device)
      -- Corrected Bus Speed configuration
      -- Corrected 8bit/16bit Data register access, regarding the Data frame size
      -I2C:
      -- Corrected invalid __I2C_DMA field in I2C_DMA_TxEvent and I2C_DMA_RxEvent functions
      Updated/added examples:
      - Added examples using Network DualStack (IPv4/IPv6) Middleware targeting MCBSTM32C (Keil.MDK-Middleware.7.0.0.pack required)
      - Updated emWin examples to emWin V5.32
      - Updated CAN examples
      - Updated USB Host examples
      - Updated USB Device CDC ACM VirtualCOM examples
      Updated RTE_Device.h: Corrected USART Pin configuration
      Added trace configuration to the debug description and updated Quick Start Guide
    </release>
    <release version="2.0.0" date="2015-10-09">
      Requires MDK-Middleware Version 6.5.0 and CMSIS Version 4.4.0
      Updated CMSIS-Drivers
      - CMSIS-Driver API V2.0 compliant
      - Added CMSIS-Driver for CAN
      Updated Examples:
      - Updated Board Support and all examples for MCBSTM32C and MCBSTM32E
      - Added examples for CAN
    </release>
    <release version="1.1.0" date="2015-02-13">
      Examples: Pack Selection for fixed version CMSIS 3.20.4 and MDK-Middleware 5.1.6
      Updated stm32f10x.h (xl-density: Added missing "STM32F10X_XL" for "RCC_AHBENR_DMA2EN" and "RCC_APB1ENR_USBEN")
    </release>
    <release version="1.0.5" date="2014-03-14">
      Component updated: Device:StdPeriph Drivers:Framework Version:3.5.1 - added file misc.c
    </release>
    <release version="1.0.4" date="2014-02-20">
      Added STM Peripheral Driver Library V1.3.0
    </release>
    <release version="1.0.3">
      Updated DMA driver (DMA2 peripheral added to build when HD, XL, HD_VL or CL device is used)
      USB Device driver update: multiple packet read, EP0 unconfiguration
      Updated SPI driver (IRQ handling corrected)
    </release>
    <release version="1.0.2">
      Updated drivers (namespace prefix ARM_ added)
    </release>
    <release version="1.0.1">
      Added devices
    </release>
    <release version="1.0.0">
      First Release version of STM32F1 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32F1</keyword>
    <keyword>STM32</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32F1 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M3" DcoreVersion="r1p1"/>

