windowsair/elaphure-dap.js/src/device/deviceList/STMicroelectronics/STM32F1/Keil.STM32F1xx_DFP.2.4.1.pdsc
        <!-- *************************  Device 'STM32F100C8'  ***************************** -->
        <device Dname="STM32F100C8">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_MD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00251732.pdf" title="STM32F100x4 STM32F100x6 STM32F100x8 STM32F100xB Data Sheet"/>
          <feature type="Timer"         n="7"       m="16"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="SPI"           n="2"       m="12000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32F100CB'  ***************************** -->
        <device Dname="STM32F100CB">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_MD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00251732.pdf" title="STM32F100x4 STM32F100x6 STM32F100x8 STM32F100xB Data Sheet"/>
          <feature type="Timer"         n="7"       m="16"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="SPI"           n="2"       m="12000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32F100R4'  ***************************** -->
        <device Dname="STM32F100R4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_LD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00251732.pdf" title="STM32F100x4 STM32F100x6 STM32F100x8 STM32F100xB Data Sheet"/>
          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="SPI"           n="1"       m="12000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="2"       m="4500000"/>
          <feature type="QFP"           n="64"/>
          <feature type="BGA"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F100R6'  ***************************** -->
        <device Dname="STM32F100R6">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_LD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00251732.pdf" title="STM32F100x4 STM32F100x6 STM32F100x8 STM32F100xB Data Sheet"/>
          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="SPI"           n="1"       m="12000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="2"       m="4500000"/>
          <feature type="QFP"           n="64"/>
          <feature type="BGA"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F100R8'  ***************************** -->
        <device Dname="STM32F100R8">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_MD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00251732.pdf" title="STM32F100x4 STM32F100x6 STM32F100x8 STM32F100xB Data Sheet"/>
          <feature type="Timer"         n="7"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="SPI"           n="2"       m="12000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="QFP"           n="64"/>
          <feature type="BGA"           n="64"/>
        </device>

