windowsair/elaphure-dap.js/src/device/deviceList/STMicroelectronics/STM32F1/Keil.STM32F1xx_DFP.2.4.1.pdsc
        <!-- *************************  Device 'STM32F100RB'  ***************************** -->
        <device Dname="STM32F100RB">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_MD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00251732.pdf" title="STM32F100x4 STM32F100x6 STM32F100x8 STM32F100xB Data Sheet"/>
          <feature type="Timer"         n="7"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="SPI"           n="2"       m="12000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="QFP"           n="64"/>
          <feature type="BGA"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F100RC'  ***************************** -->
        <device Dname="STM32F100RC">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00212417.pdf" title="STM32F100xC STM32F100xD STM32F100xE Data Sheet"/>
          <feature type="Timer"         n="11"      m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="SPI"           n="3"       m="12000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="UART"          n="2"       m="4500000"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F100RD'  ***************************** -->
        <device Dname="STM32F100RD">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00212417.pdf" title="STM32F100xC STM32F100xD STM32F100xE Data Sheet"/>
          <feature type="Timer"         n="11"      m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="SPI"           n="3"       m="12000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="5"       m="4500000"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F100RE'  ***************************** -->
        <device Dname="STM32F100RE">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00212417.pdf" title="STM32F100xC STM32F100xD STM32F100xE Data Sheet"/>
          <feature type="Timer"         n="11"      m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="SPI"           n="3"       m="12000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="5"       m="4500000"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F100V8'  ***************************** -->
        <device Dname="STM32F100V8">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_MD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00251732.pdf" title="STM32F100x4 STM32F100x6 STM32F100x8 STM32F100xB Data Sheet"/>
          <feature type="Timer"         n="7"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="80"/>
          <feature type="SPI"           n="2"       m="12000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'STM32F100VB'  ***************************** -->
        <device Dname="STM32F100VB">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_MD_VL"/>
          <debug svd="SVD/STM32F100xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00251732.pdf" title="STM32F100x4 STM32F100x6 STM32F100x8 STM32F100xB Data Sheet"/>
          <feature type="Timer"         n="7"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="80"/>
          <feature type="SPI"           n="2"       m="12000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="QFP"           n="100"/>
        </device>

