windowsair/elaphure-dap.js/src/device/deviceList/STMicroelectronics/STM32F1/Keil.STM32F1xx_DFP.2.4.1.pdsc
          <book name="Documents/CD00210843.pdf" title="STM32F103x4 STM32F103x6 Data Sheet"/>
          <feature type="Timer"         n="3"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="2"       m="4500000"/>
          <feature type="QFP"           n="64"/>
          <feature type="BGA"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F103R8'  ***************************** -->
        <device Dname="STM32F103R8">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_MD"/>
          <debug svd="SVD/STM32F103xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00161566.pdf" title="STM32F103x8 STM32F103xB Data Sheet"/>
          <feature type="Timer"         n="4"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="QFP"           n="64"/>
          <feature type="BGA"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F103RB'  ***************************** -->
        <device Dname="STM32F103RB">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_MD"/>
          <debug svd="SVD/STM32F103xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00161566.pdf" title="STM32F103x8 STM32F103xB Data Sheet"/>
          <feature type="Timer"         n="4"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="QFP"           n="64"/>
          <feature type="BGA"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F103RC'  ***************************** -->
        <device Dname="STM32F103RC">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD"/>
          <debug svd="SVD/STM32F103xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x0000C000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00191185.pdf" title="STM32F103xC STM32F103xD STM32F103xE Data Sheet"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="SPI"           n="3"       m="18000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="UART"          n="2"       m="4500000"/>
          <feature type="SDIO"          n="1"/>
          <feature type="QFP"           n="64"/>
          <feature type="CSP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F103RD'  ***************************** -->
        <device Dname="STM32F103RD">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD"/>
          <debug svd="SVD/STM32F103xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00191185.pdf" title="STM32F103xC STM32F103xD STM32F103xE Data Sheet"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="SPI"           n="3"       m="18000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="UART"          n="2"       m="4500000"/>
          <feature type="SDIO"          n="1"/>
          <feature type="QFP"           n="64"/>
          <feature type="CSP"           n="64"/>
        </device>

