windowsair/elaphure-dap.js/src/device/deviceList/STMicroelectronics/STM32F1/Keil.STM32F1xx_DFP.2.4.1.pdsc
        <!-- *************************  Device 'STM32F103VD'  ***************************** -->
        <device Dname="STM32F103VD">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD"/>
          <debug svd="SVD/STM32F103xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00191185.pdf" title="STM32F103xC STM32F103xD STM32F103xE Data Sheet"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="80"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="SPI"           n="3"       m="18000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="UART"          n="2"       m="4500000"/>
          <feature type="SDIO"          n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="100"/>
        </device>

        <!-- *************************  Device 'STM32F103VE'  ***************************** -->
        <device Dname="STM32F103VE">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD"/>
          <debug svd="SVD/STM32F103xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00191185.pdf" title="STM32F103xC STM32F103xD STM32F103xE Data Sheet"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="80"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="SPI"           n="3"       m="18000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="UART"          n="2"       m="4500000"/>
          <feature type="SDIO"          n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="100"/>
        </device>

        <!-- *************************  Device 'STM32F103VF'  ***************************** -->
        <device Dname="STM32F103VF">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_XL"/>
          <debug svd="SVD/STM32F103xx.svd"/>

          <memory id="IROM1"                         start="0x08000000" size="0x000C0000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00253742.pdf" title="STM32F103xF STM32F103xG Data Sheet"/>
          <feature type="Timer"         n="14"      m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="80"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="SPI"           n="3"       m="18000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="UART"          n="2"       m="4500000"/>
          <feature type="SDIO"          n="1"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'STM32F103VG'  ***************************** -->
        <device Dname="STM32F103VG">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_XL"/>
          <debug svd="SVD/STM32F103xx.svd"/>

          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00253742.pdf" title="STM32F103xF STM32F103xG Data Sheet"/>
          <feature type="Timer"         n="14"      m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="80"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="SPI"           n="3"       m="18000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="UART"          n="2"       m="4500000"/>
          <feature type="SDIO"          n="1"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'STM32F103ZC'  ***************************** -->
        <device Dname="STM32F103ZC">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD"/>
          <debug svd="SVD/STM32F103xx.svd"/>

          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x0000C000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32F10x_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32F10x_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documents/CD00191185.pdf" title="STM32F103xC STM32F103xD STM32F103xE Data Sheet"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="ADC"           n="21"      m="12"/>
          <feature type="IOs"           n="112"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="SPI"           n="3"       m="18000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"       m="4500000"/>
          <feature type="UART"          n="2"       m="4500000"/>
          <feature type="SDIO"          n="1"/>
          <feature type="QFP"           n="144"/>
          <feature type="BGA"           n="144"/>
        </device>

        <!-- *************************  Device 'STM32F103ZD'  ***************************** -->
        <device Dname="STM32F103ZD">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
          <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD"/>
          <debug svd="SVD/STM32F103xx.svd"/>

