windowsair/elaphure-dap.js/src/device/deviceList/STMicroelectronics/STM32F1/Keil.STM32F1xx_DFP.2.4.1.pdsc
    <condition id="STM32F1xx">
      <description>STMicroelectronics STM32F1xx Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F1*"/>
    </condition>
    <condition id="STM32F1xx VL LD">
      <description>STMicroelectronics STM32F1xx Value Line Low Density Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F100?[46]"/>
    </condition>
    <condition id="STM32F1xx VL MD">
      <description>STMicroelectronics STM32F1xx Value Line Mid Density Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F100?[8B]"/>
    </condition>
    <condition id="STM32F1xx VL HD">
      <description>STMicroelectronics STM32F1xx Value Line Mid Density Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F100?[CDE]"/>
    </condition>
    <condition id="STM32F1xx LD">
      <description>STMicroelectronics STM32F1xx Low Density Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F10[123]?[46]"/>
    </condition>
    <condition id="STM32F1xx MD">
      <description>STMicroelectronics STM32F1xx Mid Density Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F10[123]?[8B]"/>
    </condition>
    <condition id="STM32F1xx HD">
      <description>STMicroelectronics STM32F1xx High Density Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F10[123]?[CDE]"/>
    </condition>
    <condition id="STM32F1xx XL">
      <description>STMicroelectronics STM32F1xx XL Density Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F10[123]?[FG]"/>
    </condition>
    <condition id="STM32F1xx CL">
      <description>STMicroelectronics STM32F1xx Connectivity Line Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F10[57]??"/>
    </condition>

    <condition id="STM32F1xx VL LD ARMCC">
      <description>filter for STM32F1xx Value Line Low Density Device and the ARM compiler</description>
      <require condition="STM32F1xx VL LD"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F1xx VL MD ARMCC">
      <description>filter for STM32F1xx Value Line Mid Density Device and the ARM compiler</description>
      <require condition="STM32F1xx VL MD"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F1xx VL HD ARMCC">
      <description>filter for STM32F1xx Value Line Mid Density Device and the ARM compiler</description>
      <require condition="STM32F1xx VL HD"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F1xx LD ARMCC">
      <description>filter for STM32F1xx Low Density Device and the ARM compiler</description>
      <require condition="STM32F1xx LD"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F1xx MD ARMCC">
      <description>filter for STM32F1xx Mid Density Device and the ARM compiler</description>
      <require condition="STM32F1xx MD"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F1xx HD ARMCC">
      <description>filter for STM32F1xx High Density Device and the ARM compiler</description>
      <require condition="STM32F1xx HD"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F1xx XL ARMCC">
      <description>filter for STM32F1xx XL Density Device and the ARM compiler</description>
      <require condition="STM32F1xx XL"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F1xx CL ARMCC">
      <description>filter for STM32F1xx Connectivity Line Device and the ARM compiler</description>
      <require condition="STM32F1xx CL"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32F107">
      <description>STMicroelectronics STM32F107 Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F107??"/>
    </condition>
    <condition id="STM32F102_3">
      <description>STMicroelectronics STM32F102/103 Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F10[23]??"/>
    </condition>
    <condition id="STM32F105_7">
      <description>STMicroelectronics STM32F105/107 Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F10[57]??"/>
    </condition>

    <condition id="STM32F1xx CMSIS">
      <description>STMicroelectronics STM32F1xx Device with CMSIS</description>
      <require condition="STM32F1xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="STM32F1xx CMSIS GPIO">
      <description>STMicroelectronics STM32F1xx Device with CMSIS and GPIO</description>
      <require condition="STM32F1xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GPIO" />
    </condition>
    <condition id="STM32F107 CMSIS GPIO">
      <description>STMicroelectronics STM32F107 Device with CMSIS and GPIO</description>
      <require condition="STM32F107"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GPIO" />
    </condition>

    <condition id="STM32F1xx CMSIS GPIO DMA">
      <description>STMicroelectronics STM32F1xx Device with CMSIS, GPIO and DMA</description>
      <require condition="STM32F1xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GPIO" />
      <require Cclass="Device" Cgroup="DMA" />
    </condition>

    <condition id="STM32F1xx CMSIS GPIO SPI">
      <description>STMicroelectronics STM32F1xx Device with CMSIS, GPIO and SPI Driver</description>
      <require condition="STM32F1xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" />
    </condition>

    <condition id="STM32F102_3 CMSIS RTOS GPIO">
      <description>STMicroelectronics STM32F102/103 Device with CMSIS, RTOS and GPIO</description>
      <require condition="STM32F102_3"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <accept Cclass="CMSIS" Cgroup="RTOS"/>
      <accept Cclass="CMSIS" Cgroup="RTOS2"/>
      <require Cclass="Device" Cgroup="GPIO" />
    </condition>
    <condition id="STM32F105_7 CMSIS RTOS GPIO">
      <description>STMicroelectronics STM32F105/107 Device with CMSIS, RTOS and GPIO</description>
      <require condition="STM32F105_7"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <accept Cclass="CMSIS" Cgroup="RTOS"/>
      <accept Cclass="CMSIS" Cgroup="RTOS2"/>
      <require Cclass="Device" Cgroup="GPIO" />
    </condition>

    <condition id="STM32F1xx CMSIS RTOS I2C">
      <description>STMicroelectronics STM32F1xx Device with CMSIS, RTOS and I2C Driver</description>
      <require condition="STM32F1xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" />
    </condition>

    <condition id="STM32F1xx STDPERIPH">
      <description>STMicroelectronics STM32F1xx with Standard Peripherals Drivers Framework</description>
      <require condition="STM32F1xx CMSIS"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
    </condition>
    <condition id="STM32F1xx STDPERIPH RCC">
      <description>STMicroelectronics STM32F1xx with Standard Peripherals Drivers Framework and RCC</description>
      <require condition="STM32F1xx CMSIS"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC"/>
    </condition>
