windowsair/elaphure-dap.js/src/device/deviceList/STMicroelectronics/STM32F1/Keil.STM32F1xx_DFP.2.4.1.pdsc
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO"      Cversion="3.6.0" condition="STM32F1xx STDPERIPH RCC">
      <description>General-purpose I/O (GPIO) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_gpio.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_gpio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="I2C"       Cversion="3.6.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Inter-integrated circuit (I2C) interface driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_I2C
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_i2c.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_i2c.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="IWDG"      Cversion="3.6.0" condition="STM32F1xx STDPERIPH">
      <description>Independent watchdog (IWDG) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_IWDG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_iwdg.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_iwdg.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="PWR"       Cversion="3.6.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Power controller (PWR) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_PWR
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_pwr.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_pwr.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC"       Cversion="3.6.0" condition="STM32F1xx STDPERIPH">
      <description>Reset and clock control (RCC) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RCC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_rcc.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_rcc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC"       Cversion="3.6.0" condition="STM32F1xx STDPERIPH">
      <description>Real-time clock (RTC) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RTC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_rtc.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_rtc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDIO"      Cversion="3.6.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Secure digital (SDIO) interface driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SDIO
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_sdio.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_sdio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI"       Cversion="3.6.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Serial peripheral interface (SPI) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SPI
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_spi.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_spi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TIM"       Cversion="3.6.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Timers (TIM) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TIM
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_tim.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_tim.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART"     Cversion="3.6.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Universal synchronous asynchronous receiver transmitter (USART) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USART
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_usart.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_usart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDG"      Cversion="3.6.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Window watchdog (WWDG) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_WWDG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_wwdg.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_wwdg.c"/>
      </files>
    </component>
    <!-- END: STMicroelectronics Standard Peripherals Drivers -->

    <component Cclass="Device" Cgroup="GPIO" Cversion="1.3" condition="STM32F1xx CMSIS">
      <description>GPIO driver used by RTE Drivers for STM32F1 Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPIO_STM32F10x.h"/>
        <file category="source" name="RTE_Driver/GPIO_STM32F10x.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="DMA"  Cversion="1.3" condition="STM32F1xx CMSIS">
      <description>DMA driver used by RTE Drivers for STM32F1 Series</description>
      <files>
        <file category="header" name="RTE_Driver/DMA_STM32F10x.h"/>
        <file category="source" name="RTE_Driver/DMA_STM32F10x.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="CAN"          Capiversion="1.0" Cversion="1.10" condition="STM32F1xx CMSIS GPIO">
      <description>CAN Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_CAN1                /* Driver CAN1 */
        #define RTE_Drivers_CAN2                /* Driver CAN2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/CAN_STM32F10x.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI"          Capiversion="2.1" Cversion="2.2" condition="STM32F1xx CMSIS GPIO DMA">
      <description>SPI Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SPI_STM32F10x.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART"        Capiversion="2.1" Cversion="2.3" condition="STM32F1xx CMSIS GPIO DMA">
      <description>UART Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver UART4  */
        #define RTE_Drivers_USART5              /* Driver UART5  */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USART_STM32F10x.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C"          Capiversion="2.2" Cversion="2.2" condition="STM32F1xx CMSIS GPIO DMA">
      <description>I2C Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2C_STM32F10x.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="MCI"          Capiversion="2.2" Cversion="2.1" condition="STM32F1xx CMSIS GPIO DMA">
      <description>MCI Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/MCI_STM32F10x.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.1" Cversion="2.3" condition="STM32F107 CMSIS GPIO">
      <description>Ethernet MAC Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/EMAC_STM32F10x.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device"   Capiversion="2.1" Cversion="2.2" condition="STM32F102_3 CMSIS RTOS GPIO">
      <description>USB Device Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD_STM32F10x.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device"   Capiversion="2.1" Cversion="2.5" condition="STM32F105_7 CMSIS RTOS GPIO">
      <description>USB Device Driver for STM32F1 Connectivity Line Devices</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/OTG_STM32F10x_cl.c"/>
        <file category="source" name="RTE_Driver/USBD_STM32F10x_cl.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host"     Capiversion="2.1" Cversion="2.5" condition="STM32F105_7 CMSIS RTOS GPIO">
      <description>USB Host Driver for STM32F1 Connectivity Line Devices</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/OTG_STM32F10x_cl.c"/>
        <file category="source" name="RTE_Driver/USBH_STM32F10x_cl.c"/>
      </files>
    </component>

    <!-- MCBSTM32E Development Board -->
    <bundle Cbundle="MCBSTM32E" Cclass="Board Support" Cversion="2.0.0">
      <description>Keil Development Board MCBSTM32E</description>
      <doc>Boards/Keil/MCBSTM32E/Documentation/mcbstm32e.chm</doc>
      <component Cgroup="A/D Converter" Capiversion="1.00" condition="STM32F1xx CMSIS">
        <description>A/D Converter Interface for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32E/Common/ADC_MCBSTM32E.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="STM32F1xx CMSIS">
        <description>Graphic LCD Interface for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="header" name="Boards/Keil/MCBSTM32E/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Keil/MCBSTM32E/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Keil/MCBSTM32E/Common/GLCD_MCBSTM32E.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="16-bit IF" condition="STM32F1xx CMSIS">
        <description>emWin LCD 16-bit Interface for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32E/Common/LCD_X.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="STM32F1xx CMSIS GPIO">
        <description>Joystick Interface for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32E/Common/Joystick_MCBSTM32E.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F1xx CMSIS GPIO">
        <description>Buttons Interface for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32E/Common/Buttons_MCBSTM32E.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F1xx CMSIS GPIO">
        <description>LED Interface for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCBSTM32E/Common/LED_MCBSTM32E.c"/>
        </files>
      </component>
    </bundle>

